# LevelAssociationFailures Properties

---
The BuiltInFailuresLevelAssociationFailures type exposes the following members.
| Name| Description
---|---|---
| AllLevelsDeleted|  All Levels from model were deleted
Top
#### Reference
BuiltInFailuresLevelAssociationFailures Class
Autodesk.Revit.DB Namespace